Revit 2027 API
ViewSchedule.IsValidTextTypeId Method
 Identifies if the input id represents a valid text type id for use in the schedule properties.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsValidTextTypeId(
	ElementId textTypeId
)
Public Function IsValidTextTypeId (
	textTypeId As ElementId
) As Boolean
public:
bool IsValidTextTypeId(
	ElementId^ textTypeId
)
member IsValidTextTypeId :
        textTypeId : ElementId -> bool
Parameters
textTypeId ElementId
 The element id of the text type.
Return Value
Boolean
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ViewSchedule Class
Autodesk.Revit.DB Namespace